Revit 2024 API
BuiltInFailures.DimensionFailures.DimensionUnlockedAndUnequaled Property
 Dimension had to be unlocked in order to remove sketch over-constraining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionUnlockedAndUnequaled { get; }
Visual Basic
Public Shared ReadOnly Property DimensionUnlockedAndUnequaled As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionUnlockedAndUnequaled {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace